[
  "obsidian-auto-link-title",
  "better-word-count",
  "cmdr",
  "dataview",
  "dbfolder",
  "obsidian-full-calendar",
  "obsidian-outliner",
  "obsidian-kindle-plugin",
  "link-favicon",
  "obsidian-plugin-update-tracker",
  "templater-obsidian",
  "recent-files-obsidian",
  "supercharged-links-obsidian",
  "obsidian-style-settings",
  "workspaces-plus"
]